In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

import matplotlib.pyplot as plt
%matplotlib inline

/Users/taylorperkins/workspace/ds-cohort-2/test/data-question-1/venv/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/Users/taylorperkins/workspace/ds-cohort-2/test/data-question-1/venv/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [2]:
gdp_df = pd.read_csv('./data/gdp_percapita.csv')
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2016  1802.695566              NaN
1     Afghanistan  2015  1809.016488              NaN
2     Afghanistan  2014  1838.960244              NaN
3     Afghanistan  2013  1848.700026              NaN
4     Afghanistan  2012  1839.273579              NaN
5     Afghanistan  2011  1660.739856              NaN

In [3]:
internet_df = pd.read_csv('./data/internet_use.csv')
internet_df.tail(6)

     Country or Area  Year     Value  Value Footnotes
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

In [4]:
print('GDP shape: {} Rows and {} Columns'.format(*gdp_df.shape))
print('Internet: {} Rows and {} Columns'.format(*internet_df.shape))

GDP shape: 6206 Rows and 4 Columns
Internet: 4495 Rows and 4 Columns

In [5]:
gdp_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [6]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [7]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6196        Zimbabwe  1999  2699.857521              NaN
6197        Zimbabwe  1998  2761.318537              NaN
6198        Zimbabwe  1997  2725.888701              NaN
6199        Zimbabwe  1996  2698.917300              NaN
6200        Zimbabwe  1995  2488.298028              NaN
6201        Zimbabwe  1994  2529.826671              NaN
6202        Zimbabwe  1993  2360.793284              NaN
6203        Zimbabwe  1992  2384.972026              NaN
6204        Zimbabwe  1991  2681.495089              NaN
6205        Zimbabwe  1990  2605.794944              NaN

In [8]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

In [9]:
gdp_df.drop(columns=['Value Footnotes'], inplace=True)
internet_df.drop(columns=['Value Footnotes'], inplace=True)

print(f'GDP columns: {gdp_df.columns}')
print(f'Internet columns: {internet_df.columns}')

GDP columns: Index(['Country or Area', 'Year', 'Value'], dtype='object')
Internet columns: Index(['Country or Area', 'Year', 'Value'], dtype='object')

In [10]:
gdp_df.rename(index=str, inplace=True, columns={
    "Country or Area": "Country", 
    "Value": "GDP_Per_Capita"
})
internet_df.rename(index=str, inplace=True, columns={
    "Country or Area": "Country", 
    "Value": "Internet_Users_Pct"
})

print(f'GDP columns: {gdp_df.columns}')
print(f'Internet columns: {internet_df.columns}')

GDP columns: Index(['Country', 'Year', 'GDP_Per_Capita'], dtype='object')
Internet columns: Index(['Country', 'Year', 'Internet_Users_Pct'], dtype='object')

## step number 11

In [11]:
#  do some logic for step 11